## Website CMS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                   NAME                    |
|----------|-------------------------------------------|
| add      | `aws_ssm_parameter.api_token_salt`        |
| update   | `aws_ecs_service.website-cms-ecs`         |
|          | `aws_iam_policy.ecs-task-execution`       |
| recreate | `aws_ecs_task_definition.cds-website-cms` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs-task-execution will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs-task-execution" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret",
              + "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password",
              + "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token",
              + (known after apply),
            ]
        }
    }

  # data.template_file.cms_app will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "cms_app" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "DATABASE_HOST"
                          + value = "${db_host}"
                        },
                      + {
                          + name  = "BUCKET_NAME"
                          + value = "${bucket_name}"
                        },
                      + {
                          + name  = "DATABASE_USERNAME"
                          + value = "${db_user}"
                        },
                    ]
                  + image            = "${image}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  + name             = "cds-website-cms"
                  + portMappings     = [
                      + {
                          + containerPort = 1337
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "${db_password_arn}"
                        },
                      + {
                          + name      = "TOKEN"
                          + valueFrom = "${github_token_arn}"
                        },
                      + {
                          + name      = "ADMIN_JWT_SECRET"
                          + valueFrom = "${admin_jwt_secret_arn}"
                        },
                      + {
                          + name      = "API_TOKEN_SALT"
                          + valueFrom = "${api_token_salt_arn}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "admin_jwt_secret_arn" = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
          + "api_token_salt_arn"   = (known after apply)
          + "aws_region"           = "ca-central-1"
          + "awslogs-group"        = "ecs-cds-website-cms"
          + "bucket_name"          = "cds-website-assets-prod"
          + "db_host"              = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
          + "db_password_arn"      = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
          + "db_user"              = "postgres"
          + "fargate_cpu"          = "1024"
          + "fargate_memory"       = "2048"
          + "github_token_arn"     = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
          + "image"                = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
        }
    }

  # aws_ecs_service.website-cms-ecs will be updated in-place
  ~ resource "aws_ecs_service" "website-cms-ecs" {
        id                                 = "arn:aws:ecs:ca-central-1:773858180673:service/website-cms-cluster/website-cms-ecs"
        name                               = "website-cms-ecs"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:65" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.cds-website-cms must be replaced
-/+ resource "aws_ecs_task_definition" "cds-website-cms" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:773858180673:task-definition/website-cms-task:64" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "BUCKET_NAME"
                          - value = "cds-website-assets-prod"
                        },
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "strapi.cnpapuat1xtk.ca-central-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DATABASE_USERNAME"
                          - value = "postgres"
                        },
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                    ]
                  - essential        = true
                  - image            = "773858180673.dkr.ecr.ca-central-1.amazonaws.com/cds-website/cms"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ecs-cds-website-cms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-cds-website-cms"
                        }
                    }
                  - mountPoints      = []
                  - name             = "cds-website-cms"
                  - portMappings     = [
                      - {
                          - containerPort = 1337
                          - hostPort      = 1337
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password"
                        },
                      - {
                          - name      = "TOKEN"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token"
                        },
                      - {
                          - name      = "ADMIN_JWT_SECRET"
                          - valueFrom = "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "website-cms-task" -> (known after apply)
      ~ revision                 = 64 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.ecs-task-execution will be updated in-place
  ~ resource "aws_iam_policy" "ecs-task-execution" {
        id        = "arn:aws:iam::773858180673:policy/WebsiteTaskExecutionPolicies"
        name      = "WebsiteTaskExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ssm:DescribeParameters"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:773858180673:parameter/website/github_token",
                          - "arn:aws:ssm:ca-central-1:773858180673:parameter/website/db_password",
                          - "arn:aws:ssm:ca-central-1:773858180673:parameter/website/admin_jwt_secret",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.api_token_salt will be created
  + resource "aws_ssm_parameter" "api_token_salt" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "/website/api_token_salt"
      + tags_all  = (known after apply)
      + tier      = "Standard"
      + type      = "SecureString"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.strapi"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.cms-load-balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.front_end"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.s3_distribution"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_instance.website-cms-database"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_network_acl.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.image-repository"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.website-cms-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.website-cms-ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.cds-website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_eip.website-cms[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs-task-execution"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs-task-execution-role"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.task_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_internet_gateway.website-cms"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cw"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_nat_gateway.gw[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route_table.website-cms-private_subnet[1]"]
WARN -...
```

</details>
